In [1]:
import pandas as pd
import numpy as np

In [3]:
dates=pd.date_range('20130101',periods=6)
df=pd.DataFrame(np.arange(24).reshape(6,4),index=dates, columns=['A','B','C','D'])
df

             A   B   C   D
2013-01-01   0   1   2   3
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [4]:
df.iloc[0,1]=np.nan
df.iloc[1,2]=np.nan
df

             A     B     C   D
2013-01-01   0   NaN   2.0   3
2013-01-02   4   5.0   NaN   7
2013-01-03   8   9.0  10.0  11
2013-01-04  12  13.0  14.0  15
2013-01-05  16  17.0  18.0  19
2013-01-06  20  21.0  22.0  23

## 使用 dropna直接去掉有 NaN 的行或列

In [10]:
df.dropna(
    axis=0,   # 0: 對列進行操作; 1: 对行进行操作
    how='any')# 'any': 只要存在 NaN 就 drop 掉; 
             #'all': 必须全部是 NaN 才 drop

             A     B     C   D
2013-01-03   8   9.0  10.0  11
2013-01-04  12  13.0  14.0  15
2013-01-05  16  17.0  18.0  19
2013-01-06  20  21.0  22.0  23

# pd.fillna()

## 將NaN的值用其他值代替,比如代替成0:

In [15]:
df.fillna(value=0)

             A     B     C   D
2013-01-01   0   0.0   2.0   3
2013-01-02   4   5.0   0.0   7
2013-01-03   8   9.0  10.0  11
2013-01-04  12  13.0  14.0  15
2013-01-05  16  17.0  18.0  19
2013-01-06  20  21.0  22.0  23

## pd.isnull()

### 判斷是否有缺失數據NaN,為True表示缺失數據:

In [18]:
df.isnull()

                A      B      C      D
2013-01-01  False   True  False  False
2013-01-02  False  False   True  False
2013-01-03  False  False  False  False
2013-01-04  False  False  False  False
2013-01-05  False  False  False  False
2013-01-06  False  False  False  False

### 檢測在數據中是否存在NaN,如果存在就返回True:

In [19]:
np.any(df.isnull())==True

True